// Написать программу, которая выводит на экран все числа от 1 до 10.

using System;

namespace Task_1
{
    class Program
    {
        static void Main()
        {
            for (int i = 1; i <= 10; i++)
            {
                Console.WriteLine(i);
            }

            Console.ReadKey();
        }
    }
}
